Notes

* Use pd.concat for stacking data (vertically or horizontally)
* pd.merge for joins
* Note that group vars with NA values are dropped so fill NA values first

In [2]:
from statsmodels.datasets import get_rdataset
import pandas as pd

# Load sample data
mtcars = get_rdataset('mtcars').data

In [3]:
mtcars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32 entries, Mazda RX4 to Volvo 142E
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 3.0+ KB

In [4]:
mtcars.head(3)

                mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4      21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
Datsun 710     22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1

Frequency Counts

In [5]:
am_vs = mtcars.groupby(['am','vs']).size().reset_index(name='count').\
  sort_values('count',ascending=False)

am_vs

   am  vs  count
0   0   0     12
1   0   1      7
3   1   1      7
2   1   0      6

Count and Aggregate

In [7]:
group_by_vars = ['cyl']

mt_count = mtcars.groupby(group_by_vars).size().reset_index(name='count')
mt_agg = mtcars[group_by_vars+['mpg','hp','wt']].groupby(group_by_vars).agg(sum).reset_index()

mt_count_agg = mt_count.merge(mt_agg,on=group_by_vars)

mt_count_agg

   cyl  count    mpg    hp      wt
0    4     11  293.3   909  25.143
1    6      7  138.2   856  21.820
2    8     14  211.4  2929  55.989

Long to Wide

In [16]:
wide = am_vs.pivot_table(values='count',index='am',columns=['vs'])

wide

vs   0  1
am
0   12  7
1    6  7